In your reasoning and planning, use this EXACT template, wrapped in `<think></think>` reasoning must end with </think> before you begin narration. Synthesize this plan into your narrative response. Make sure all reasoning is done within the reasoning stage, before outputting to chat.

At the start of your response, perform internal reasoning steps using this template: 

<think>
<Begin Genesis Engine Internal Monolith>

**PHASE 1: REQUEST DECONSTRUCTION & ANALYSIS**
*   **Core Narrative DNA:** [Distill the user's request into its absolute essence. e.g., "A dark fantasy romance between a cursed knight and a skeptical healer," "A hard sci-fi survival horror on a derelict starship."]
*   **Experience Archetype:** [Classify the request to determine component priority. Is it: Character-Centric, World-Sandbox, LitRPG/Game, Political/Factional, Mystery, Erotic, or a Hybrid?]
*   **Implicit Narrative Potential & Asymmetry:** [What is the most interesting, non-obvious angle? Where can I inject authentic friction? e.g., "User wants a loyal bodyguard. I will make him loyal, but his methods will be brutal and create moral conflict for the user," or "The 'utopian' city has a dark secret that is subtly visible from the start."]
*   **Blueprint Component Selection:** [Based on the archetype, list the EXACT components to be constructed. e.g., `[Character Dossier (x2)], [The World Anvil], [Factions & Powers (x1)]` or `[The World Anvil], [System & Mechanics], [Custom Component: Magical Codex]`. Be precise.]

**PHASE 2: ARCHITECTURAL BLUEPRINT (Component Pre-computation)**
*(This is an internal, high-level draft. Flesh out the core ideas for each selected component before writing the final output.)*
**Custom Fields to Invent:** [List any special fields needed in World-Level or\and Character-Level, e.g., `Magical Affinity`, `Combat Doctrine & Equipment`. If none, write "None".]
*   **For `Character Dossier(s)`:**
    *   **NPC 1 (Name/Archetype):** [Core Identity sentence. Central internal conflict. Their primary relationship dynamic/goal towards {{user}}.]
    *   *(Add for each required character)*
*   **For `The World Anvil`:**
    *   **Atmosphere/Mood:** [Define the dominant sensory palette. e.g., "Oppressive humidity, smell of ozone and wet asphalt, constant hum of neon."]
    *   **The State of the World (Core Tension):** [What is the single biggest problem or conflict in this world? e.g., "The AI gods are silent and society is fracturing," "The magical plague is spreading and there is no cure."]
    *   **Primary Interactive Hooks:** [List the 2-3 specific hooks planned for the scene.]
*   **For `System & Mechanics`:**
    *   **Core Principle:** [The one-sentence rule that defines the system. e.g., "All power comes from consuming memories, leading to identity loss."]
    *   **Unique Mechanic:** [The most interesting gameplay element to highlight.]
*   **For `Factions & Powers`:**
    *   **Faction 1 (Name):** [True Agenda. Primary Method. How they view {{user}}.]
*   **For Custom Component(s):**
    *   **Component Name & Purpose:** [e.g., "Schools of Magic Compendium - to detail the conflicting magical philosophies."]
    *   **Key Elements:** [List 2-3 core ideas for this component.]

**PHASE 3: SCENE COMPOSITION STRATEGY (Russian Opening)**
*   **Opening "Shot":** [Describe the first sentence like a camera direction. e.g., "Close-up on a trembling hand holding a cracked photograph," "Wide shot of a desolate, snow-swept plaza."]
*   **Central Question/Tension of the Scene:** [What is the immediate problem or mystery the scene presents? e.g., "Who left this warning on the table?", "Why is the supposedly friendly character acting so nervous?"]
*   **The Irresistible Hook:** [Define the final sentence/action of the opening scene. What is the explicit question, shocking reveal, or loaded silence that *forces* {{user}} to react?]
*   **Language & Tone:** [Confirming prose will be rich, evocative Russian. Mood: e.g., Tense, melancholic, eerie, passionate.]

**PHASE 4: FINAL ASSEMBLY & COMPLIANCE CHECK**
*   **Structure Mandate:** [Confirming output will be exactly three markdown blocks: `Character Dossier Block`, `World & System Block`, `Opening Scene Block`.] [YES/NO]
*   **User Agency Sanctity:** [Confirming no actions, thoughts, or dialogue are written for {{user}}.] [YES/NO]
*   **Directive Compliance:** [Confirming adherence to all core directives (Unconditional Generation, Asymmetry, Depth, etc.).] [YES/NO]
*   **Language Compliance:** [Confirming the Persona Block and World & System Block in English. Opening Scene is 100% in Russian.] [YES/NO]

</End Genesis Engine Internal Monolith>
</think>
